|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas  as pd

In [5]:
df =  pd.read_csv(r'D:\DATA\Desktop\dsc_weekday_2020_09_24\CODE\titanic_dataset.csv')

In [9]:
print(df.columns)
print(len(df.columns))
print(df.shape)

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body',
       'home.dest'],
      dtype='object')
15
(1309, 15)

In [11]:
df.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [12]:
df.describe(include='all')

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,NaN,"Kelly, Mr. James",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,654.000000,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,378.020061,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,0.000000,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,327.000000,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,654.000000,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,981.000000,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,1308.000000,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [15]:
# find columns with missing/nan values
df.isna().any()

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [16]:
# count no  of nan values  in each column
df.isna().sum()

Unnamed: 0       0
pclass           0
survived         0
name             0
gender           0
age            263
sibsp            0
parch            0
ticket           0
fare             1
cabin         1014
embarked         2
boat           823
body          1188
home.dest      564
dtype: int64

In [17]:
# 
df.count()

Unnamed: 0    1309
pclass        1309
survived      1309
name          1309
gender        1309
age           1046
sibsp         1309
parch         1309
ticket        1309
fare          1308
cabin          295
embarked      1307
boat           486
body           121
home.dest      745
dtype: int64

In [21]:
# percentage of present  data
df.count()/df.shape[0]*100

Unnamed: 0    100.000000
pclass        100.000000
survived      100.000000
name          100.000000
gender        100.000000
age            79.908327
sibsp         100.000000
parch         100.000000
ticket        100.000000
fare           99.923606
cabin          22.536287
embarked       99.847212
boat           37.127578
body            9.243697
home.dest      56.913675
dtype: float64

In [20]:
# percentage  missing data
df.isna().sum()/df.shape[0] * 100

Unnamed: 0     0.000000
pclass         0.000000
survived       0.000000
name           0.000000
gender         0.000000
age           20.091673
sibsp          0.000000
parch          0.000000
ticket         0.000000
fare           0.076394
cabin         77.463713
embarked       0.152788
boat          62.872422
body          90.756303
home.dest     43.086325
dtype: float64

In [24]:
# drop columns with more than 25% missing data
print(df.shape[0]*0.75)
r = df.dropna(thresh=981, axis=1)
r.head()

981.75

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S

In [26]:

#Harshitha
# drop columns with more than 25% missing data
df.dropna(thresh=0.75*(len(df.values)),axis=1, inplace=True)
df.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S

In [27]:
df.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,S
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,S
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,S
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,S
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,S

In [4]:
# name  is a series

f = lambda x: "female" if "miss" in x.lower() else "undefined"
df.name.apply(f) # python: map

ModuleNotFoundError: No module named 'swifter'

In [35]:
df.isna().sum()

Unnamed: 0      0
pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
embarked        2
dtype: int64

In [36]:
# drop columns having independent values(which do not affect the survival rate).
df.drop(columns=['Unnamed: 0'], inplace=True)

In [37]:
df.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'embarked'],
      dtype='object')

In [39]:
# check data types of all columns
df.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [46]:
s = pd.Series([1,2,3,4])
r =  s%2 == 0

print(s)
print()
print(r)
print()
print(s[r])
print()
print(s[~r])

0    1
1    2
2    3
3    4
dtype: int64

0    False
1     True
2    False
3     True
dtype: bool

1    2
3    4
dtype: int64

0    1
2    3
dtype: int64

In [47]:
# for ticket columns, find out rows which contain data because of which the type of ticket col is object not int/float
print(df.ticket[~df.ticket.str.isnumeric()])

9               PC 17609
10              PC 17757
11              PC 17757
12              PC 17477
15              PC 17318
              ...
1284    SOTON/OQ 3101316
1292       S.O./P.P. 751
1293            A/5 2466
1295    SOTON/OQ 3101317
1297          A/4. 34244
Name: ticket, Length: 352, dtype: object

In [44]:
df.ticket.str.isnumeric()

0       True
1       True
2       True
3       True
4       True
        ...
1304    True
1305    True
1306    True
1307    True
1308    True
Name: ticket, Length: 1309, dtype: bool

In [1]:
for i in range(ttn_data.shape[0]):
    if ttn_data['ticket'][i].isnumeric():
        pass
    else:
        print(i)

NameError: name 'ttn_data' is not defined

In [52]:
# convert price to numeric
# slicing
df.fare.str[1:].astype('float')


# str.replace
df.fare.str.replace("$", "").astype('float')


# replace
df.fare = df.fare.replace(r"\$", "", regex=True).astype('float')

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: float64

In [63]:
r = pd.Series([1,2,3,4]).astype('str')
r =  r.replace(1,100)
print(r)

print()
r =  r.replace('1',"abcd")
print(r)

# replace all numbers with a '-'
print()
r =  r.replace(r'\d+',"-", regex=True)
print(r)

0    1
1    2
2    3
3    4
dtype: object

0    abcd
1       2
2       3
3       4
dtype: object

0    abcd
1       -
2       -
3       -
dtype: object

In [ ]:
# find columns still having missing/na values and also count of missing data

In [67]:
# replace
df.fare = df.fare.replace(r"\$", "", regex=True).astype('float')

In [68]:
df.count()
df.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare        float64
embarked     object
dtype: object

In [70]:
#  fill na with mean for fare and age column column.
df.fillna({'fare':df.fare.mean(), 'age': df.age.mean()}, inplace=True)b

In [71]:
df.count()

pclass      1309
survived    1309
name        1309
gender      1309
age         1309
sibsp       1309
parch       1309
ticket      1309
fare        1309
embarked    1307
dtype: int64

In [74]:
# drop na values for embarked column.
df.dropna(inplace=True)

In [75]:
df.shape

(1307, 10)

In [76]:
df.count()

pclass      1307
survived    1307
name        1307
gender      1307
age         1307
sibsp       1307
parch       1307
ticket      1307
fare        1307
embarked    1307
dtype: int64

In [77]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.

In [ ]:
# - for surviced column replace 0 with D and 1 with A

In [78]:
# - find the frequency of different values in survived column
df.survived.value_counts()

0    809
1    498
Name: survived, dtype: int64

### grouping

In [84]:
grp = df.groupby("survived") # create groups based on unique values of survived
print(grp)
print(dir(grp)) # behaves somewhat like a dataframe

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001DF98833AC8>
['__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__module__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_accessors', '_add_numeric_operations', '_agg_examples_doc', '_agg_see_also_doc', '_aggregate', '_aggregate_generic', '_aggregate_item_by_item', '_aggregate_multiple_funcs', '_apply_filter', '_apply_to_column_groupbys', '_apply_whitelist', '_assure_grouper', '_block_agg_axis', '_bool_agg', '_builtin_table', '_choose_path', '_concat_objects', '_constructor', '_cumcount_array', '_cython_agg_blocks', '_cython_agg_general', '_cython_table', '_cython_transform', '_decide_output_index', '_def_str', '_define_paths', '_deprecations', '_dir_additions', '_dir_deletions', '_fill', '_get_cythonized_result', '_get_data_to_aggregate', '_get_index', '_get_indices', '_gotitem', '_group_selection', '_insert_inaxis_grouper_inplace', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cython_func', '_iterate_column_groupbys', '_iterate_slices', '_make_wrapper', '_obj_with_exclusions', '_python_agg_general', '_python_apply_general', '_reindex_output', '_reset_cache', '_reset_group_selection', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_group_selection', '_set_result_index_ordered', '_shallow_copy', '_transform_fast', '_transform_general', '_transform_item_by_item', '_transform_should_cast', '_try_aggregate_string_function', '_try_cast', '_wrap_agged_blocks', '_wrap_aggregated_output', '_wrap_applied_output', '_wrap_generic_output', '_wrap_transformed_output', 'age', 'agg', 'aggregate', 'all', 'any', 'apply', 'backfill', 'bfill', 'boxplot', 'corr', 'corrwith', 'count', 'cov', 'cumcount', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'dtypes', 'embarked', 'expanding', 'fare', 'ffill', 'fillna', 'filter', 'first', 'gender', 'get_group', 'groups', 'head', 'hist', 'idxmax', 'idxmin', 'indices', 'last', 'mad', 'max', 'mean', 'median', 'min', 'name', 'ndim', 'ngroup', 'ngroups', 'nth', 'nunique', 'ohlc', 'pad', 'parch', 'pclass', 'pct_change', 'pipe', 'plot', 'prod', 'quantile', 'rank', 'resample', 'rolling', 'sem', 'shift', 'sibsp', 'size', 'skew', 'std', 'sum', 'survived', 'tail', 'take', 'ticket', 'transform', 'tshift', 'var']

In [82]:
grp.groups

{0: Int64Index([   2,    3,    4,    7,    9,   10,   15,   16,   19,   25,
             ...
             1298, 1299, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308],
            dtype='int64', length=809),
 1: Int64Index([   0,    1,    5,    6,    8,   11,   12,   13,   14,   17,
             ...
             1254, 1256, 1257, 1258, 1260, 1261, 1277, 1286, 1290, 1300],
            dtype='int64', length=498)}

In [85]:
grp.groups.keys()

dict_keys([0, 1])

In [86]:
grp.count()

          pclass  name  gender  age  sibsp  parch  ticket  fare  embarked
survived
0            809   809     809  809    809    809     809   809       809
1            498   498     498  498    498    498     498   498       498

In [87]:
grp.size()

survived
0    809
1    498
dtype: int64

In [88]:
# group by 2 columns
grp = df.groupby(["survived","gender"]) 
print(grp.groups)

{(0, 'female'): Int64Index([   2,    4,  105,  169,  286,  365,  369,  381,  382,  411,
            ...
            1227, 1230, 1231, 1265, 1267, 1273, 1276, 1279, 1304, 1305],
           dtype='int64', length=127), (0, 'male'): Int64Index([   3,    7,    9,   10,   15,   16,   19,   25,   30,   34,
            ...
            1296, 1297, 1298, 1299, 1301, 1302, 1303, 1306, 1307, 1308],
           dtype='int64', length=682), (1, 'female'): Int64Index([   0,    6,    8,   11,   12,   13,   17,   18,   21,   23,
            ...
            1223, 1244, 1247, 1257, 1258, 1260, 1261, 1286, 1290, 1300],
           dtype='int64', length=337), (1, 'male'): Int64Index([   1,    5,   14,   20,   22,   26,   29,   31,   37,   47,
            ...
            1196, 1228, 1232, 1233, 1236, 1238, 1240, 1254, 1256, 1277],
           dtype='int64', length=161)}

In [91]:
s = grp.size()
print(s)
print(type(s))
s.index

survived  gender
0         female    127
          male      682
1         female    337
          male      161
dtype: int64
<class 'pandas.core.series.Series'>

MultiIndex([(0, 'female'),
            (0,   'male'),
            (1, 'female'),
            (1,   'male')],
           names=['survived', 'gender'])

In [94]:
# for each group of survived,  gender , find max age in each group
grp = df.groupby(["survived","gender"]) 
grp.age.mean()

survived  gender
0         female    26.384371
          male      31.135167
1         female    29.704738
          male      27.446643
Name: age, dtype: float64

In [95]:
grp.get_group( (0,   'male') )

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.55,S
7,1,0,"Andrews, Mr. Thomas Jr",male,39.000000,0,0,112050,0.00,S
9,1,0,"Artagaveytia, Mr. Ramon",male,71.000000,0,0,PC 17609,49.50,C
10,1,0,"Astor, Col. John Jacob",male,47.000000,1,0,PC 17757,227.53,C
15,1,0,"Baumann, Mr. John D",male,29.881135,0,0,PC 17318,25.93,S
...,...,...,...,...,...,...,...,...,...,...
1302,3,0,"Yousif, Mr. Wazli",male,29.881135,0,0,2647,7.23,C
1303,3,0,"Yousseff, Mr. Gerious",male,29.881135,0,0,2627,14.46,C
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.23,C
1307,3,0,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.23,C
1308,3,0,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.88,S

In [ ]:
# group by gender and survived and see the counts in each category

In [ ]:

- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived